{
  "main": {
    "name": "Drake Nguyen",
    "title": "Front-end Developer",
    "greeting": "Hi, I'm Drake Nguyen",
    "bio": {
      "paragraph1": "I am an IT specialist with experience in Content Management System, QA testing, and front end development.  I have a passion for problem-solving and creating visually stunning and user-friendly websites and applications.",
      "paragraph2": "My experience and focus are on developing web applications using JavaScript, React, and SASS.  However, I have experience building full-stack MERN applications.  I am a flexible developer, open to learning other languages.",
      "paragraph3": "My Background:",
      "paragraph4": "I graduated with a Bachelor's degree in Business Administration with a concentration in Finance. I worked in accounting and payroll for a time and found out that this was not a career path I wanted.  Dissatisfied, I found a job at Rockwell Collins (now Collins Aerospace) where I worked in  Software Content Integration. Here I found my passion and drive in technology. I worked in their Airshow (Asxi) moving maps division where I would build content configurations through a proprietary Content Management System for over 50 commercial airlines such as Korean Air, Etihad Airways, EVA, etc. My work consisted of configuring HTML, XML, CSS, MySQL databases, and media files and QA testing across platforms such as in-seat units, browsers, and mobile app.  However, this came to an end when a merger with United Technologies saw my division move from Irvine, California to Cedar Rapids, Iowa.",
      "paragraph5": "My passion for technology led me to learn Javascript and React while I was looking for another job.  I soon found a new position for Inspectre Solutions as their IT Administrator.  In this position, I manage their equipments, resolve technical issues, manage vendor/employee database, and act as WordPress web admin.  As the web admin, I create new pages, update content ones, manage plugins, and test to ensure links and mobile responsiveness before deploying.",
      "paragraph6": "Currently, I also volunteer as part of HackForLA's merge team.  My duties include reviewing merge requests, pulling down merge requests into IDE to test on Docker to ensure the website issue is fixed, and ensuring the fix is mobile responsive and works across browsers."
    },
    "contactmessage": "Send me an email if you have any questions!",
    "email": "drakeknguyen@yahoo.com",
    "phone": "714-837-1648",
    "website": "https://www.drakenguyen.dev",
    "resumelink": "https://drive.google.com/uc?export=download&id=1VVtQ05QnxxfPFnsbnsZQebMzyk0-Y67a",
    "socialmedia": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/drake-nguyen-550ab228/",
        "className": "fab fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/drakenguyen4000",
        "className": "fab fa-github"
      }
    ]
  },
  "skills": {
    "language": [
      "React / Redux",
      "Javascript ES6 / DOM Manipulation",
      "HTML5",
      "CSS3 / Flexbox / Grid",
      "Tailwind / Bootstrap",
      "SASS",
      "Node / npm",
      "Express",
      "MongoDB / Mongoose"
    ],
    "skills": [
      "Pair Coding",
      "Writing Issues and Pull Request",
      "Review Code & Merging Pull Request",
      "Troubleshoot & Debug Software",
      "User Interface Testing",
      "RESTful API",
      "Responsive Websites",
      "Wireframe"
    ],
    "tools": [
      "Git / GitHub",
      "Jira",
      "Visual Studio Code",
      "Docker",
      "Photoshop", 
      "Figma"
    ]
  },
  "projects": [
     {
      "title": "Pokemon Battle Console",
      "blurb": "For best effect, play on your mobile device.",
      "summary": "Pokemon Battle Console is a mobile Pokemon battle game built using vanilla javascript and mobile first design.",
      "stack": "I used Figma to design the wireframe and then built the application in vanilla javascript.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1676175364/Pokemon_Battle_Console_cqgdhy.png",
      "url": "https://drakenguyen4000.github.io/pokemonbattle/",
      "code": "https://github.com/drakenguyen4000/pokemonbattle"
    },
    {
      "title": "Smart Shopping List",
      "blurb": "Keep track of your shopping!",
      "summary": "A smart shopping list app built using code pairing teams at the Collab Lab.  The app predicts a user's shopping habits.",
      "stack": "Built using React, JavaScript, and Google Firestore.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1692675719/Smartshoppinglist_omfvqr.png",
      "url": "https://tcl-56-smart-shopping-li-ffe7d.web.app/",
      "code": "https://github.com/the-collab-lab/tcl-56-smart-shopping-list"
    },
    {
      "title": "Issues Tracker",
      "blurb": "An app to track bugs & other issues!",
      "summary": "Issues tracker is a fullstack MERN application that enables your company to track bugs/issues of your projects. This applicaiton uses RESTful route API architecture and is deployed on Heroku.",
      "stack": "This app is developed using MongdoDB, React, Express, and Node.js.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1676175298/Issue_Tracker_tldprb.png",
      "url": "https://reactissuetracker.herokuapp.com/#/",
      "code": "https://github.com/drakenguyen4000/issue_tracker"
    },
    {
      "title": "eApparel",
      "blurb": "An online store.",
      "summary": "eApparel is a fullstack MERN application that allows shoppers to browse the latest fashion, order what they love, and track their past order history.  The app is built using MERN stack, utilizing Redux state management.",
      "stack": "This app was developed using MongdoDB, React/Redux, Express, Node.js, and Stripe payment.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1676175267/eApparel_Store_tnpfvm.png",
      "url": "https://eapparelstore.herokuapp.com/#/",
      "code": "https://github.com/drakenguyen4000/eapparelstore"
    },
    {
      "title": "Vietnam Travels",
      "blurb": "Looking to relax?",
      "summary": "A travel site I built that offers tours of different regions of Vietnam. Since I enjoy traveling there so much, I decided to build a project around it.",
      "stack": "This site was built using Bootstrap, Javascript, JQuery, HTML5, and CSS3.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1620258354/vietnamtravels_rvqklk.jpg",
      "url": "https://drakenguyen4000.github.io/vietnamtravels/",
      "code": "https://github.com/drakenguyen4000/vietnamtravels"
    }
  ]
}
