{
  "main": {
    "name": "Drake Nguyen",
    "title": "Front-end Web Developer",
    "greeting": "Hi, I'm Drake Nguyen",
    "bio": {
      "paragraph1": "Have you ever been in a career that you did not enjoy?  That was me working in accounting; I hated those Mondays.  Then a friend referred me to a configuration quality analyst position at Collins Aerospace, and this was when I realized my passion was in technology.  It was true, when you love your job, time flies; I looked forward to Mondays at jobs I loved.",
      "paragraph2": "Although I did work with HTML, CSS, and aspects of engineering, I didn't code.  I was actually intimidated by code languages initially.  Eventually, I decided to learn code to improve my skill set.  It started with an Udemy course called The Web Developer Bootcamp by Colt Steele.  What started with one course became multiple courses in Javascript, CSS, MERN, and React on Udemy, Youtube, books, and online documentation.  As I progressed, I still faced imposter syndrome, but looking at other developers' success I felt I could make this a career too.",
      "paragraph3": "I think like anything in life there's always doubt when there's a lack of knowledge.  However, the more I learned and built projects the more confident I became as a developer.  I started out building replicas from tutorials and making changes to them.  I keep practicing like this until I got good at creating my own components.  Then I took that knowledge and started building my own passion projects from scratch.  I was able to build two full-stack apps using MERN and even a battle game complete with a simple ai opponent in Javascript.  The biggest hurdle when I built these projects was writing the code; it's always easier to write down a plan than it is to execute the code to make things function as intended.  It seemed like every function added was a bug in waiting.  I spent more than a hundred hours, dozens upon dozens of Stackoverflow posts, to find an answer or even a hint, and sometimes finding nothing at all. In those instances, I had to spend hours of critical thinking and testing to resolve the issue.  And yet nothing beats the rush, the satisfaction, of resolving that bug and getting a component to work properly.  It's been such an amazing journey of success and failure for me.  It pushed me as a person to have the patience and determination to seek and resolves issues.",
      "paragraph4": "Looking back, if I had another chance to pick which major to take in my college years, I would have picked computer science.  Yet I feel like sometimes we do not know what we really want in life until we have experienced it.  I really can't change the past that's why learn to code, to better my future.  I would rather try and fail until I've learned from my mistakes to achieve my dreams than settle for life as it is.  So I'll keep learning and building until I can make this a career.",
      "paragraph5": "Currently, I am a front-end developer, focusing on Javascript and React.  However, I have delved into MERN stack and built full-stack apps with RESTful API."
    },
    "contactmessage": "If you want to collaborate with me on any projects or have any questions about my projects, feel free to email!",
    "email": "drakeknguyen@yahoo.com",
    "phone": "714-837-1648",
    "website": "https://drakenguyen4000.github.io/portfolio_v2/",
    "resumelink": "https://drakenguyen4000.github.io/portfolio/7-download/DrakeNguyen-Resume-4.docx",
    "socialmedia": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/drake-nguyen-550ab228/",
        "className": "fab fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/drakenguyen4000",
        "className": "fab fa-github"
      }
    ]
  },
  "skills": {
    "language": [
      "React / Redux",
      "Javascript ES6 / DOM Manipulation",
      "HTML5",
      "CSS3 / Flexbox / Grid",
      "Bootstrap 3/4",
      "SASS",
      "Node / npm",
      "Express",
      "MongoDB / Mongoose",
      "MySQL"
    ],
    "skills": [
      "Troubleshoot & Debug Software",
      "Quality Assurance & Testing",
      "Content & Database Management",
      "RESTful API",
      "Create Responsive Websites",
      "PSD Model Conversion",
      "Multi-task Projects",
      "Attention to Detail & Creative Eye",
      "Wireframe"
    ],
    "tools": [
      "Git / GitHub",
      "CLI (Linux)",
      "Jira",
      "Visual Studio Code",
      "Photoshop", 
      "Figma"
    ]
  },
  "projects": [
     {
      "title": "Pokemon Battle Console",
      "blurb": "For best effect, play on your mobile device.",
      "summary": "Pokemon Battle Console is a mobile Pokemon battle game built using vanilla javascript and mobile first design.",
      "stack": "I used Figma to design the wireframe and then built the application in vanilla javascript.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1673068552/pokemonbattleconsole_ilslba.jpg",
      "url": "https://drakenguyen4000.github.io/pokemonbattleconsole/#/",
      "code": "https://github.com/drakenguyen4000/pokemon_battles/tree/main/client"
    },
    {
      "title": "eApparel",
      "blurb": "A online store!",
      "summary": "eApparel is a fullstack MERN application that allows shoppers to browse the latest fashion, order what they love, and track their past order history.  The app is built using MERN stack, utilizing Redux state management.",
      "stack": "This app was developed using MongdoDB, React/Redux, Express, Node.js, and Stripe payment.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1620258353/eapparel_z32s2l.jpg",
      "url": "https://eapparelstore.herokuapp.com/#/",
      "code": "https://github.com/drakenguyen4000/eapparelstore"
    },
    {
      "title": "Issues Tracker",
      "blurb": "An app to track bugs & other issues!",
      "summary": "Issues tracker is a fullstack MERN application that enables your company to track bugs/issues of your projects. This applicaiton uses RESTful route API architecture and is deployed on Heroku.",
      "stack": "This app is developed using MongdoDB, React, Express, and Node.js.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1620258353/issuestracker_cho0ev.jpg",
      "url": "https://reactissuetracker.herokuapp.com/#/",
      "code": "https://github.com/drakenguyen4000/issue_tracker"
    },
    {
      "title": "Weather Forecast",
      "blurb": "What's your weather like?",
      "summary": "A weather forecaster that searches by gps location or user input. The app uses AJAX to fetch api data from Weather Bit to generate a five day weather forecast.",
      "stack": "This app was built using React, Javascript, HTML5, and CSS3.",
      "image": "https://res.cloudinary.com/dkn4000/image/upload/v1620258353/myforecast_clvv3r.jpg",
      "url": "https://drakenguyen4000.github.io/weatherforecast/",
      "code": "https://github.com/drakenguyen4000/weatherforecast"
    }
  ]
}
